Revit 2026 API

# EnergyAnalysisDetailModelOptionsEnergyModelType Property

---

It indicates whether the energy model is based on rooms/spaces or building elements.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EnergyModelType EnergyModelType { get; set; }
```
```vb
Public Property EnergyModelType As EnergyModelType
	Get
	Set
```
```cpp
public:
property EnergyModelType EnergyModelType {
	EnergyModelType get ();
	void set (EnergyModelType value);
}
```
```fsharp
member EnergyModelType : EnergyModelType with get, set
```

#### Property Value

EnergyModelType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default value is EnergyModelType::SpatialElement.

#### Reference

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace